---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
source: html/db5f0fd5-a1b8-9c33-0f77-2cb52da875a1.htm
---
# StructuralSectionRectangleHSS Members

Creates a new instance of Structural Section Rectangle HSS shape with the associated set of parameters,
 used to attach to structural element.